#+TITLE:    Believe: A Bel interpreter built with C11 [Beta]
#+AUTHOR:   Lucas Vieira
# #+DATE:     2019
#+PROPERTY: header-args:C :eval no :main no :tangle believe.c
#+STARTUP:  content

:LATEX_PROPERTIES:
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4paper,twoside]
#+LATEX_HEADER: \usepackage[brazil]{babel}
#+LATEX_HEADER: \usepackage{times}
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
#+LATEX_HEADER: \usepackage[T1]{fontenc}
#+LATEX_HEADER: \usepackage{color}
#+LATEX_HEADER: \usepackage{microtype}
#+LATEX_HEADER: \usepackage{titlesec}
#+LATEX_HEADER: \usepackage[brazilian, hyperpageref]{backref}
#+LATEX_HEADER: \usepackage{hyperref}
#+LATEX_HEADER: \usepackage[alf,abnt-emphasize=bf,abnt-doi=link]{abntex2cite}
#+LATEX_HEADER: \usepackage{indentfirst}
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \usepackage{graphicx}
#+LATEX_HEADER: \usepackage{amssymb}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{geometry}
#+LATEX_HEADER: \usepackage{tikz}
#+LATEX_HEADER: \usepackage{draftwatermark}

# Remove colorization of links
#+LATEX_HEADER: \definecolor{blue}{RGB}{41,5,195}
#+LATEX_HEADER: \makeatletter
#+LATEX_HEADER: \hypersetup{
# #+LATEX_HEADER:     pdftitle={%t},
# #+LATEX_HEADER:     pdfauthor={%a},
# #+LATEX_HEADER:     pdfkeywords={%k},
# #+LATEX_HEADER:     pdfsubject={%d},
# #+LATEX_HEADER:     pdfcreator={%c},
#+LATEX_HEADER:     colorlinks=true,
#+LATEX_HEADER:     linkcolor=black,
#+LATEX_HEADER:     citecolor=black,
#+LATEX_HEADER:     filecolor=black,
#+LATEX_HEADER:     urlcolor=blue,
#+LATEX_HEADER:     bookmarksdepth=4
#+LATEX_HEADER: }
#+LATEX_HEADER: \makeatother
#+BIND: org-latex-hyperref-template ""
:END:

** Running the program

This script attempts to build and run the Bel interpreter. It will
also enable verbose output for the garbage collector.

#+begin_src bash :tangle no :eval yes :cache yes :results output :exports code
make
printf "\n"
export GC_PRINT_STATS=1
./believe
#+end_src

#+RESULTS[94b57beffeb8149ed822eb732ce8c9ac526fa891]:
#+begin_example
clang --std=c11 -g -O2 -Wall -DBEL_DEBUG -c -o believe.o believe.c
clang --std=c11 -g -O2 -Wall -DBEL_DEBUG -lgc -o believe believe.o

Believe 0.1
A Bel Lisp interpreter
Copyright (c) 2019 Lucas Vieira
This software is distributed under the MIT license.
-- Running debug tests
  -- String test
"Hello, Bel!" => Hello, Bel!
"There is no Bel without \bel"
  -- Notation test
((foo . bar) baz . quux)
  -- List test
(The quick brown fox jumps over the lazy dog)
  -- Closure representation test
(lit clo nil (xar) (* xar xar))
  -- Character List & Lookup test
Char: 097 (a) => "01100001"
Char: 098 (b) => "01100010"
Char: 099 (c) => "01100011"
Char: 100 (d) => "01100100"
Char: 101 (e) => "01100101"
Char: 102 (f) => "01100110"
Char: 103 (g) => "01100111"
Char: 104 (h) => "01101000"
Char: 105 (i) => "01101001"
Char: 106 (j) => "01101010"
  -- Read five bytes from Believe's source
"00100011" => \#
"01101001" => \i
"01101110" => \n
"01100011" => \c
"01101100" => \l
"01110101" => \u
"01100100" => \d
"01100101" => \e
"00100000" => \ 
"00111100" => \<
  -- Show a few errors on screen
(lit err "Unable to open stream ~a." "waddawaddawadda")
Is this an error? y
(lit err "Cannot extract the car of ~a." t)
(lit err "Cannot extract the cdr of ~a." t)
  -- Lookup a few primitives and print them
(lit prim car)
(lit prim cdr)
(lit prim coin)
(lit prim stat)
nil
(lit err "The symbol ~a is unbound." wadawada)
  -- Lexical environment tests
    -- Registering local `foo`
Environment:       ((foo . bar))
Lookup:            bar

    -- Assigning new value to `foo`
Environment:       ((foo lit baz))
Assignment result: foo
Lookup:            (lit baz)

    -- Unbinding `foo`
Environment:       nil
Unbinding result:  foo
Lookup:            (lit err "The symbol ~a is unbound." foo)
  -- Globals and assignment tests
    -- Assigning `foo` without previous definition
WARNING: Assignment failed, registering new global
Assignment result: foo
Lookup:            bar

    -- Shadowing global `foo` with a local
Environment:       ((foo . quux))
Lookup:            quux
    -- Unbinding `foo` three times

Environment:       nil
Unbinding result:  foo
Lookup:            bar

Environment:       nil
Unbinding result:  foo
Lookup:            (lit err "The symbol ~a is unbound." foo)

Environment:       nil
Unbinding result:  nil
Lookup:            (lit err "The symbol ~a is unbound." foo)
#+end_example

